IC.ДополненияКА/src/Catalogs/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f3b86010-6dc9-4bd6-9fda-850ce2f2ea58">
  <name>ВидыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="2daac090-5bc6-4138-93d1-b8a802101e6d">
    <name>ШаблонНаименованияДляПечатиНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="408bd3ed-cb07-4796-a2f4-3f63fc3ff9bd">
    <name>ШаблонРабочегоНаименованияНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

IC.ДополненияКА/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="bcf7d7fa-e8eb-40ae-b61c-2f1a7e19a77c">
    <name>ФайлКартинки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a05b5fd6-cafb-4617-8026-2bf40ef192a8">
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="344b6917-b413-4fae-aadd-d62836822de6">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3ebfaae7-710d-4b97-aff3-149de91a4f89">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c122409e-0e2f-4354-a036-4e8f6440b616">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IC.ДополненияКА/src/CommonModules/ДКА_КорректировкаДанных/Module.bsl
// @strict-types
 
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Область ПрограммныйИнтерфейс

// Изменение шаблонов наименований.
// 
// Параметры:
//  Аргументы - Структура - Аргументы:
// * ИскомыйТекст - Строка - Искомый текст для замены
// * Замена - Строка - Текст замены
// * Свойство - ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения -
// * ТипНаименования - Строка -
// * УникальныйИдентификатор - УникальныйИдентификатор -
// 
// Возвращаемое значение:
//  Структура - Изменение шаблонов наименований:
// * Всего - Число - Количество обработанных элементов
// * Ошибки - Число - Количество ошибок
Функция ИзменениеШаблоновНаименований(Аргументы) Экспорт

	ВидОбъект = Справочники.ВидыНоменклатуры.ПустаяСсылка();

	Итоги = Новый Структура("Всего, Ошибки", 0, 0);
	Счетчик = 1;

	ИмяРеквизита = ?(Аргументы.ТипНаименования = "Рабочее",
					 "ШаблонРабочегоНаименованияНоменклатуры",
					 "ШаблонНаименованияДляПечатиНоменклатуры");

	Выборка = ВидыНоменклатуры();
	Итоги.Всего = Выборка.Количество();

	Пока Выборка.Следующий() Цикл

		ТекущийВидСсылка = Выборка.Ссылка;
		//@skip-check statement-type-change
		ВидОбъект = ТекущийВидСсылка.ПолучитьОбъект();
		//@skip-check invocation-parameter-type-intersect
		ВидОбъект[ИмяРеквизита] = СтрЗаменить(ВидОбъект[ИмяРеквизита], Аргументы.ИскомыйТекст, Аргументы.Замена);

		Попытка
			ВидОбъект.Записать();
			Счетчик = Счетчик + 1;
		Исключение
			Итоги.Ошибки = Итоги.Ошибки + 1;
		КонецПопытки;

		ДлительныеОперации.СообщитьПрогресс(Окр((Счетчик + Итоги.Ошибки) / Итоги.Всего, 0));

	КонецЦикла;

	Возврат Итоги;

КонецФункции

// Замена символов в артикулах номенклатуры.
// 
// Параметры:
//  Аргументы - Структура - Аргументы:
// * СтрокаПоиска - Строка - Искомый текст или символ для замены
// * СтрокаЗамены - Строка - Текст замены
// * Производитель - СправочникСсылка.Производители -
// * УникальныйИдентификатор - УникальныйИдентификатор -
// 
// Возвращаемое значение:
//  Структура - Изменение шаблонов наименований:
// * Всего - Число - Количество обработанных элементов
// * Ошибки - Число - Количество ошибок
Функция ИзменениеАртикулов(Аргументы) Экспорт

	НоменклатураОбъект = Справочники.ВидыНоменклатуры.ПустаяСсылка();

	Итоги = Новый Структура("Всего, Ошибки", 0, 0);
	Счетчик = 1;

	Выборка = НоменклатураПоПроизводителю(Аргументы.Производитель);
	Итоги.Всего = Выборка.Количество();

	Пока Выборка.Следующий() Цикл

		Если СтрНайти(Выборка.Артикул, Аргументы.СтрокаПоиска) > 0 Тогда

			НоменклатураСсылка = Выборка.Ссылка;
			//@skip-check statement-type-change
			НоменклатураОбъект = НоменклатураСсылка.ПолучитьОбъект();
			НоменклатураОбъект.Артикул = СтрЗаменить(НоменклатураОбъект.Артикул,
													 Аргументы.СтрокаПоиска,
													 Аргументы.СтрокаЗамены);

			Попытка
				НоменклатураОбъект.Записать();
			Исключение
				Итоги.Ошибки = Итоги.Ошибки + 1;
			КонецПопытки;

		КонецЕсли;

		Счетчик = Счетчик + 1;

		ДлительныеОперации.СообщитьПрогресс(Окр(Счетчик / Итоги.Всего * 100, 0));

	КонецЦикла;

	Возврат Итоги;

КонецФункции

// Переименование свойства.
// 
// Параметры:
//  Свойство - ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения - Свойство
//  НовоеИмя - Строка - Новое имя
// 
// Возвращаемое значение:
//  Булево -  Успешность переименования
Функция ПереименованиеСвойства(Свойство, НовоеИмя) Экспорт

	Успешно = Истина;

	ИмяСвойства = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Свойство, "Имя");
	Сигнатура = СтрШаблон("[{ДР.%1}]", ИмяСвойства);
	Замена = СтрШаблон("[{ДР.%1}]", НовоеИмя);

	Виды = ВидыСоСвойствомВШаблоне(ИмяСвойства);

	НачатьТранзакцию();
	
	// Замена имени свойства
	СвойствоОбъект = Свойство.ПолучитьОбъект();
	СвойствоОбъект.Имя = НовоеИмя;

	Попытка
		СвойствоОбъект.Записать();
	Исключение
		ОтменитьТранзакцию();
		Успешно = Ложь;
	КонецПопытки;
	
	// Замена имени свойства в шаблонах наименования номенклатуры
	Если Успешно Тогда

		Для Каждого Вид Из Виды Цикл

			ВидОбъект = Вид.ПолучитьОбъект();
			ВидОбъект.ШаблонРабочегоНаименованияНоменклатуры = СтрЗаменить(ВидОбъект.ШаблонРабочегоНаименованияНоменклатуры,
																		   Сигнатура,
																		   Замена);
			ВидОбъект.ШаблонНаименованияДляПечатиНоменклатуры = СтрЗаменить(ВидОбъект.ШаблонНаименованияДляПечатиНоменклатуры,
																		   Сигнатура,
																		   Замена);
			Попытка
				ВидОбъект.Записать();
			Исключение
				ОтменитьТранзакцию();
				Успешно = Ложь;
			КонецПопытки;
			
		КонецЦикла;

	КонецЕсли;
	
	// Фиксация транзакции
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;

	Возврат Успешно;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает выборку видов номенклатуры
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//		* Ссылка - СправочникСсылка.ВидыНоменклатуры - Вид номенклатуры
Функция ВидыНоменклатуры()

	ТекстЗапроса = "ВЫБРАТЬ
				   |	ВидыНоменклатуры.Ссылка КАК Ссылка
				   |ИЗ
				   |	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
				   |ГДЕ
				   |	ВидыНоменклатуры.ПометкаУдаления = ЛОЖЬ
				   |	И ВидыНоменклатуры.ЭтоГруппа = ЛОЖЬ";
	Запрос = Новый Запрос(ТекстЗапроса);

	Выборка = Запрос.Выполнить().Выбрать();

	Возврат Выборка

КонецФункции

// Возвращает выборку номенклатуры по производителю.
// 
// Параметры:
//  Производитель - СправочникСсылка.Производители -  Производитель
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//	* Ссылка - СправочникСсылка.Номенклатура - Номенклатура
//	* Артикул - Строка - Артикул
Функция НоменклатураПоПроизводителю(Производитель)

	ТекстЗапроса = "ВЫБРАТЬ
				   |	Номенклатура.Ссылка КАК Ссылка,
				   |	Номенклатура.Артикул КАК Артикул
				   |ИЗ
				   |	Справочник.Номенклатура КАК Номенклатура
				   |ГДЕ
				   |	Номенклатура.Производитель = &Производитель
				   |	И Номенклатура.ПометкаУдаления = ЛОЖЬ";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Производитель", Производитель);

	Выборка = Запрос.Выполнить().Выбрать();

	Возврат Выборка;

КонецФункции

// Возвращает массив видов номенклатуры с использованием свойства в рабочем наименовании или в наименовании для печати
// 
// Параметры:
//  ИмяСвойства - Строка -  Имя свойства
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ВидыНоменклатуры -  Виды со свойством в шаблоне
Функция ВидыСоСвойствомВШаблоне(ИмяСвойства)

	Виды = Новый Массив;
	Сигнатура = СтрШаблон("[{ДР.%1}]", ИмяСвойства);

	ТекстЗапроса = "ВЫБРАТЬ
	|	ВидыНоменклатуры.Ссылка КАК Ссылка,
	|	ВидыНоменклатуры.ШаблонНаименованияДляПечатиНоменклатуры КАК ШаблонНаименованияДляПечати,
	|	ВидыНоменклатуры.ШаблонРабочегоНаименованияНоменклатуры КАК ШаблонРабочегоНаименования
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	ВидыНоменклатуры.ШаблонНаименованияДляПечатиНоменклатуры НЕ ПОДОБНО """"
	|	И ВидыНоменклатуры.ШаблонРабочегоНаименованияНоменклатуры НЕ ПОДОБНО """"";

	Запрос = Новый Запрос(ТекстЗапроса);

	Выборка = Запрос.Выполнить().Выбрать();
	ААА = Выборка.Количество();

	Пока Выборка.Следующий() Цикл

		Если СтрНайти(Выборка.ШаблонНаименованияДляПечати, Сигнатура) > 0
			 Или СтрНайти(Выборка.ШаблонРабочегоНаименования, Сигнатура) > 0 Тогда
			Виды.Добавить(Выборка.Ссылка);
		КонецЕсли;

	КонецЦикла;

	Возврат Виды;

КонецФункции

#КонецОбласти
